In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [2]:
salary = pd.read_csv('StackOverflowDeveloperSurvey.csv', usecols=['Salary']).squeeze().dropna()
salary.head()

2     113750.0
14    100000.0
17    130000.0
18     82500.0
22    100764.0
Name: Salary, dtype: float64

In [3]:
salary.sort_values(ascending=False).head()

18237    195000.0
1696     195000.0
6743     195000.0
6717     193750.0
2370     192000.0
Name: Salary, dtype: float64

In [4]:
salary.sort_values(ascending=True).head()

23953    0.000000
2951     0.000000
23907    0.000000
4517     0.000000
9082     0.014682
Name: Salary, dtype: float64

In [5]:
salary.sort_values(ascending=False, inplace=True)
salary.head()

18237    195000.0
1696     195000.0
6743     195000.0
6717     193750.0
2370     192000.0
Name: Salary, dtype: float64

In [6]:
salary.sort_index(ascending=False).head()

26019     70000.000000
26012     70000.000000
26009    109100.000000
26002     45161.290323
26001     33949.044586
Name: Salary, dtype: float64

In [7]:
maxSalaries = salary.head(100)
minSalaries = salary.tail(100)

In [8]:
maxSalaries.mean()

173864.75605935283

In [9]:
minSalaries.mean()

277.8274402720276